#Область ПрограмныйИнтерфейс
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.КЛ_КонтактныеЛица.Форма.ФормаЭлемента" Тогда
		ДобавитьЭлементыКонтактноеЛицо(Форма);
	ИначеЕсли ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВДокументВГруппу(Форма);
		ДобавитьСкидкуВДокумент(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВДокумент(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВДокумент(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВДокументВГруппу(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВДокументВГруппу(Форма);
	КонецЕсли; 
	

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограмныйИнтерфейс
Процедура ДобавитьЭлементыКонтактноеЛицо(Форма)
	
	НовыйЭлемент = Форма.Элементы.Добавить("ФИО", Тип("ПолеФормы"), Форма.Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Наименование";
	
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактныйТелефон", Тип("ПолеФормы"), Форма.Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КонтактныйТелефон";
	
	НовыйЭлемент = Форма.Элементы.Добавить("Контрагент", Тип("ПолеФормы"),Форма.Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Владелец";
	
	НовыйЭлемент = Форма.Элементы.Добавить("Должность", Тип("ПолеФормы"), Форма.Элементы.ПраваяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Должность";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДействуетНаОсновании", Тип("ПолеФормы"), Форма.Элементы.ПраваяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДействуетНаОсновании";
	
	НовыйЭлемент = Форма.Элементы.Добавить("Заметка", Тип("ПолеФормы"),Форма.Элементы.СредняяКолонка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Заметка";
	
КонецПроцедуры


Процедура ДобавитьПолеКонтактноеЛицоВДокументВГруппу(Форма)

	НовыйЭлемент = Форма.Элементы.Вставить("КЛ_КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво,Форма.Элементы.Договор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";	
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВДокумент(Форма)

	НовыйЭлемент = Форма.Элементы.Вставить("КЛ_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.Договор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";	
	
КонецПроцедуры 

Процедура ДобавитьСкидкуВДокумент(Форма)
	
	Команда = Форма.Команды.Добавить("ПересчитатьСУчетомСкидки");
	Команда.Заголовок = "Пересчитать с учетом скидки";
	Команда.Действие  = "КЛ_ПересчитатьСУчетомСкидки";
	
	НовыйЭлемент = Форма.Элементы.Добавить("КнопкаПересчитатьСУчетомСкидки", Тип("КнопкаФормы"),Форма.Элементы.ДопГруппаШапка);
	НовыйЭлемент.ИмяКоманды = "ПересчитатьСУчетомСкидки";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	
	НовыйЭлемент = Форма.Элементы.Вставить("КЛ_СогласованнаяСкидка", Тип("ПолеФормы"),Форма.Элементы.ДопГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КЛ_СогласованнаяСкидкаПриИзменении"); 
КонецПроцедуры


#КонецОбласти
